# vsoStateGetNameChng

## Description
```pascal
FUNCTION vsoStateGetNameChng(
				hObj           : HANDLE;
				VAR outOldName : STRING;
				VAR outNewName : STRING) : BOOLEAN;
```

```python

def vs.vsoStateGetNameChng(hObj):
    return (BOOLEAN, outOldName, outNewName)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|outOldName|STRING||
|outNewName|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events